rkz/extension/Documents/ЗаявкаНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
		</Properties>
	</Document>
</MetaDataObject>

rkz/extension/Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаявокНаРасходованиеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/Documents/ЗаявкаНаРасходованиеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ПервыйБИТ ЛистТребований [21]  [Пасенов В.В.] [24.06.2024] + 	
	НовыйЭлемент = Элементы.Добавить("бит_ГруппаЧастичноеСогласование", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ДекорацияЧастичноеСогласование", Тип("ДекорацияФормы"),Элементы.бит_ГруппаЧастичноеСогласование);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись; 
	НовыйЭлемент.Ширина = 9;
	
	//Создаем Команду бит_ЧастичноеСогласование
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ЧастичноеСогласование");
	НоваяКоманда.Действие = "бит_ЧастичноеСогласованиеНаКлиенте";//Имя процедуры
	НоваяКоманда.Заголовок = "(бит) Частичное согласование";
	
	//Создаем Кнопку бит_ЧастичноеСогласование
	НоваяКнопка = Элементы.Добавить("бит_ЧастичноеСогласование", Тип("КнопкаФормы"), Элементы.бит_ГруппаЧастичноеСогласование);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "бит_ЧастичноеСогласование";	
	// ПервыйБИТ ЛистТребований [21]  [Пасенов В.В.] [24.06.2024] - 
	
КонецПроцедуры  

&НаКлиенте
Процедура бит_ЧастичноеСогласованиеНаКлиенте()
	
	// ПервыйБИТ ЛистТребований [21]  [Пасенов В.В.] [24.06.2024] + 
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("бит_ЧастичноеСогласованиеПослеЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВсегоКОплате", Объект.СуммаДокумента); 
	
	ПараметрыФормы.Вставить("ОтложитьНаДату", Объект.ЖелательнаяДатаПлатежа);
	
	ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.бит_ФормаЧастичноеСогласование", ПараметрыФормы, , ,  , , Оповещение); 
	// ПервыйБИТ ЛистТребований [21]  [Пасенов В.В.] [24.06.2024] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ЧастичноеСогласованиеПослеЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	// ПервыйБИТ ЛистТребований [21]  [Пасенов В.В.] [24.06.2024] + 
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;   
	
	ТекущаяСуммаДокумента = Объект.СуммаДокумента;
	ТекущийСтатусДокумента = Объект.Статус;
	
	Если Не Результат.СуммаОтложить = 0 Тогда
		
		Попытка
			
			Объект.СуммаДокумента = Результат.СуммаОплаты;
			Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована");
			
			СуммаДокументаПриИзмененииКлиент();
			СуммаДокументаПриИзмененииСервер();
			
			ТекущийСтатус = Объект.Статус; 
			
			ЭтотОбъект.Записать();
			ЭтаФорма.ОбновитьОтображениеДанных();
			
			бит_ОбработкаЧастичногоСогласованияЗРДС(Результат);
			
		Исключение 
			
			Объект.СуммаДокумента = ТекущаяСуммаДокумента;
			Объект.Статус = ТекущийСтатусДокумента;
			
			СуммаДокументаПриИзмененииКлиент();
			СуммаДокументаПриИзмененииСервер();
			
			ЭтаФорма.ОбновитьОтображениеДанных();
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЕсли;
	// ПервыйБИТ ЛистТребований [21]  [Пасенов В.В.] [24.06.2024] - 
	
КонецПроцедуры 

&НаСервере
Процедура бит_ОбработкаЧастичногоСогласованияЗРДС(Результат)
	
	// ПервыйБИТ ЛистТребований [21]  [Пасенов В.В.] [24.06.2024] + 
	НоваяЗРДС = Объект.Ссылка.Скопировать();
	НоваяЗРДС.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована"); 
	НоваяЗРДС.Дата = ТекущаяДатаСеанса();
	НоваяЗРДС.СуммаДокумента = Результат.СуммаОтложить;
	НоваяЗРДС.ЖелательнаяДатаПлатежа = Результат.ОтложитьНаДату;
	
	ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(НоваяЗРДС, НоваяЗРДС.СуммаДокумента, Ложь);
	
	ПараметрыПересчетаНДС = Новый Структура("ЦенаВключаетНДС", Истина);
	СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", ПараметрыПересчетаНДС);
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НоваяЗРДС.РасшифровкаПлатежа, СтруктураДействий, Неопределено);
	
	Попытка
		НоваяЗРДС.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		НоваяЗРДС.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	// ПервыйБИТ ЛистТребований [21]  [Пасенов В.В.] [24.06.2024] -
	
КонецПроцедуры

#КонецОбласти
